cypress/fixtures/invoice-01.json

{
    "metaData": {
        "id": "_invoice16806ad9-c64f-4ec4-ba99-39813ac1c373",
        "status": "Overdue",
        "documentName": null,
        "currency": "zł"
    },
    "header": [
        {
            "id": "invoiceNo",
            "value": "05"
        },
        {
            "id": "invoiceDate",
            "value": "2026-01-09"
        },
        {
            "id": "invoiceDueDate",
            "value": "2026-01-23"
        },
        {
            "id": "invoiceType",
            "value": ""
        }
    ],
    "headerImage": "",
    "body": [
        {
            "id": "seller",
            "value": ""
        },
        {
            "id": "sellerVAT",
            "value": ""
        },
        {
            "id": "sellerStreetNo",
            "value": ""
        },
        {
            "id": "sellerPostCode",
            "value": ""
        },
        {
            "id": "sellerCity",
            "value": ""
        },
        {
            "id": "sellerBankAcct",
            "value": ""
        },
        {
            "id": "sellerBank",
            "value": ""
        },
        {
            "id": "sellerSwift",
            "value": ""
        },
        {
            "id": "buyer",
            "value": "Veovo"
        },
        {
            "id": "buyerVAT",
            "value": ""
        },
        {
            "id": "buyerStreetNo",
            "value": ""
        },
        {
            "id": "buyerPostCode",
            "value": ""
        },
        {
            "id": "buyerCity",
            "value": ""
        }
    ],
    "invoiceTable": [
        {
            "item": "test",
            "quantity": 5,
            "unit": "days",
            "unitNetPrice": 5,
            "vatPercent": 5,
            "totalNet": 25,
            "totalGross": 26.25
        }
    ],
    "footer": {
        "netTotal": "25.00",
        "vatTotal": "1.25",
        "grossTotal": "26.25"
    }
}